/**************************
2019年4月16日22:33:56
P108
练习3.5.3
练习3.35 编写一段程序利用指针将数组中的元素置为0
练习3.36 编写一段程序比较两数组是否想等，再写一段程序比较连个vector对象是否想等
********************************/
#include <iostream>
#include <string>
#include <vector>
#include <stdio.h>
using namespace std;

int main()
{
	//练习3.31
	int a[10];
	int *p;
	p = a;
	for (int i = 0; i < 10; i++)
	{
		*p = 0;
		p++;
	}
	cout << "a :";
	for (int i = 0; i < 10; i++)
		cout << a[i] << "  ";
	cout << endl;

	//练习3.36
    //未指明比较数组比较的是什么，如果是比较数组名，是比较数组首地址；如果比较数组所有元素，则需要逐一遍历数组元素才能确认是否想等，会写，时间关系不写了
	//
	while (1);
}